In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

# drop from series

In [3]:
ser1 = Series(np.arange(3),index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int32

In [5]:
new_ser = ser1.drop('a')
new_ser

b    1
c    2
dtype: int32

In [6]:
ser1

a    0
b    1
c    2
dtype: int32

# drop from dataframe

In [9]:
new_df = DataFrame(np.arange(25).reshape(5,5), index = ['a','b','c','d','e'], columns = ['C1','C2','C3','C4','C5'])
new_df

   C1  C2  C3  C4  C5
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [14]:
# drop row

In [11]:
new_df1 = new_df.drop('c')
new_df1

   C1  C2  C3  C4  C5
a   0   1   2   3   4
b   5   6   7   8   9
d  15  16  17  18  19
e  20  21  22  23  24

In [15]:
# drop columns

In [16]:
new_df2 = new_df1.drop('C3', axis=1)
new_df2

   C1  C2  C4  C5
a   0   1   3   4
b   5   6   8   9
d  15  16  18  19
e  20  21  23  24